DataProcessors/КонтрагентыЮЛ_ЗаполниГУИДыПоИННКПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>КонтрагентыЮЛ_ЗаполниГУИДыПоИННКПП</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Comment>ЮЛ - юридическое лицо, ФЛ- физ.лицо не ИП, ИП- физлицо ИП</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КлючиВИсточникахДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Comment>Момент времени установки ГУИД</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДанных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИБ_ТипыДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКлюча</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИБ_ТипыДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеКлюча</Name>
							<Comment>Идентификатор (ГУИД для справочника) в источнике данных</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникДанных</Name>
							<Comment>Вспопомогательный, используется  если не заполнен ТипДанных, совместно с ТипДанныXML</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ИБ_ИсточникиДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДанныхXML</Name>
							<Comment>Вспопомогательный, используется  если не заполнен ТипДанных, совместно с ИсточникиДанных</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКлюча</Name>
							<Comment>Представление в источнике данных</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопПредставлениеКлюча</Name>
							<Comment>Для справочника - код, для перечисления - порядковый номер значения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Взаимосвязи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипВзаимосвязи</Name>
							<Comment>ОП - обособленное подразделение, ГО - головная организация</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Comment>Внешний ключ для связи с табличной частью КонтактнаяИнформация</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
					<Comment>Каналы коммуникаций с контрагентом</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Comment>Код строки как первичный ключ</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИБ_ТипыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ИБ_ТипыДанных</Name>
			<Comment>Сложные типы данных (классы объектов) источников данных</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИБ_ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДанныхXML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДанных1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИБ_ИсточникиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ИБ_ИсточникиДанных</Name>
			<Comment>Информационные базы - источники данных</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПараметрыСоединения</Name>
					<Comment>Параметры соединения c информационной базой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Comment>Префикс источника данных (для совместимости)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НавСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/КонтрагентыЮЛ_ЗаполниГУИДыПоИННКПП/Ext/ObjectModule.bsl
&НаСервере
Функция ДобавитьСтроки_ЗаписатьСозданныйОбъект(ИсточникДанных, БИ, СпрОбъект) 		
	//Значение по умолчанию = 0 - количество добавленных строк
	//----------------------------------------------------
	
	ИНН = СокрЛП(СпрОбъект.ИНН);
	КПП = СокрЛП(СпрОбъект.КПП);
	
	Доступно = 		СтрДлина(ИНН)=10
				И 	СтрДлина(КПП)=9;   
				
	Если Не Доступно Тогда
		ЗаписьЖурналаРегистрации("ДобавитьСтроки_ЗаписатьСозданныйОбъект", УровеньЖурналаРегистрации.Информация, , СтрШаблон("ПараметрыСоединения = %1, ИНН = %2, КПП = %3", ИсточникДанных.ПараметрыСоединения, ИНН, КПП), "Ошибка в типе или значении аргументов");
		Возврат 0;
	КонецЕсли;
	
	Если 	
		//Альфы
		//-------
		СтрНайти(ИсточникДанных.ПараметрыСоединения, "sto_oper")>0   		//Казань
		Или СтрНайти(ИсточникДанных.ПараметрыСоединения, "alc_oper")>0  	//Москва Альянс Пестриков И.
		Или СтрНайти(ИсточникДанных.ПараметрыСоединения, "luidor_sto")>0 	//НН Пестриков И.
		Или СтрНайти(ИсточникДанных.ПараметрыСоединения, "rm_rarus")>0   	//Саранск
		Или СтрНайти(ИсточникДанных.ПараметрыСоединения, "ufa_rarus")>0  	//Уфа
		Или СтрНайти(ИсточникДанных.ПараметрыСоединения, "cheb_rarus")>0   //Чебоксары
		
		//Оперучет
		//---------
		Или СтрНайти(ИсточникДанных.ПараметрыСоединения, "asc_oper")>0		Тогда
		
		БИ_Запрос 		=  БИ.NewObject("Запрос");
		БИ_Запрос.Текст = "ВЫБРАТЬ Т.Ссылка КАК Ссылка, Т.Код КАК Код, Т.Наименование КАК Наименование ИЗ Справочник.Контрагенты КАК Т ГДЕ Т.ИНН = &ИНН И Т.КПП = &КПП";
		БИ_Запрос.УстановитьПараметр("ИНН", ИНН);
		БИ_Запрос.УстановитьПараметр("КПП", КПП);			
		БИ_РезультатЗапроса = БИ_Запрос.Выполнить();	
		
		//Все остальные базы
		//-------------------
	Иначе 				
		БИ_Запрос 		=  БИ.NewObject("Запрос");
		БИ_Запрос.Текст = "ВЫБРАТЬ Т.Ссылка КАК Ссылка, Т.Код КАК Код, Т.Наименование КАК Наименование ИЗ Справочник.Контрагенты КАК Т ГДЕ Т.ИНН = &ИНН И Т.КПП = &КПП";	
		БИ_Запрос.УстановитьПараметр("ИНН", ИНН);
		БИ_Запрос.УстановитьПараметр("КПП", КПП);			
		БИ_РезультатЗапроса = БИ_Запрос.Выполнить();
	КонецЕсли;
	
	Если БИ_РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	БИ_Выборка = БИ_РезультатЗапроса.Выбрать();
	
	ДобавленоСтрок = 0;
	Пока БИ_Выборка.Следующий() Цикл
		
		ДобавленоСтрок = ДобавленоСтрок+1;
		
		НоваяСтрока = СпрОбъект.ИсточникиДанных.Добавить();
		НоваяСтрока.Период 				=	ТекущаяДата();
		НоваяСтрока.ИсточникДанных 		= 	ИсточникДанных.Ссылка;
		
		ТипДанныхXML = БИ.СериализаторXDTO.XMLТипЗнч(БИ_Выборка.Ссылка);
		Если ТипДанныхXML <> Неопределено Тогда
			ТипДанныхXMLСтрокой 		= ТипДанныхXML.URIПространстваИмен+":"+ТипДанныхXML.ИмяТипа;	
			НоваяСтрока.ТипДанныхXML 	= ТипДанныхXMLСтрокой;
		КонецЕсли;
		
		//Поиск элемента справочника ИБ:ТипыДанных
		//----------------------------------------
		Если ЗначениеЗаполнено(НоваяСтрока.ИсточникДанных) И ЗначениеЗаполнено(НоваяСтрока.ТипДанныхXML) Тогда
			Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Т.Ссылка КАК Ссылка ИЗ Справочник.ИБ_ТипыДанных КАК Т ГДЕ Т.ИсточникДанных = &ИсточникДанных И Т.ТипДанныхXML = &ТипДанныхXML";
			Парам = Новый Структура("ИсточникДанных, ТипДанныхXML", ИсточникДанных.Ссылка, ТипДанныхXMLСтрокой);
			РезультатЗапроса = ОбщегоНазначения.ЗапросВыполнить(Текст, Парам);
			Если РезультатЗапроса.Пустой() Тогда
				ЗаписьЖурналаРегистрации("ДобавитьСтроки_ЗаписатьСозданныйОбъект", УровеньЖурналаРегистрации.Информация, , СтрШаблон("ПараметрыСоединения = %1, ИНН = %2, КПП = %3", ИсточникДанных.ПараметрыСоединения, ИНН, КПП), "Не найден элемент справочника ИБ:ТипыДанных");
			Иначе
				НоваяСтрока.ТипДанных = РезультатЗапроса.Выгрузить()[0][0];
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока.Идентификатор	=	БИ.XMLСтрока(БИ_Выборка.Ссылка);
		НоваяСтрока.Представление	= 	БИ_Выборка.Наименование+" ["+БИ_Выборка.Код+"]";		
	КонецЦикла;
	
	Возврат ДобавленоСтрок;
КонецФункции


&НаСервере
Функция ЗагрузиГУИДЫ_ДляЮЛ_ПоИННКПП_НаСервере(СпрСсылка, СпрОбъект = Неопределено) Экспорт
	ЗначениеПоУмолчанию = Ложь;
	
	КоличествоДобавленныхСтрок = 0;
	
	Если  СпрОбъект = Неопределено Тогда        
		СпрОбъектБылоНеопределено = Истина;
	Иначе
		СпрОбъектБылоНеопределено = Ложь;
	КонецЕсли;
	
	ИсточникДанных = Справочники.ИБ_ИсточникиДанных.Выбрать();
	
	Пока ИсточникДанных.Следующий() Цикл
		
		Если СтрНайти(ИсточникДанных.Комментарий, "не загружать") Тогда
			Продолжить;
		КонецЕсли;
		
		БИ = ОбщегоНазначения.ПолучитьПодключениеБД(ИсточникДанных.ПараметрыСоединения);
		Если БИ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		//Возможны следуюищие режимы вызова
		//1 Непосредственно, т.е. не из элемента справочника контрагенты. Тогда при исполнении элемент не перезаписывается,
		//1.1. Непосредственно, но не выбран элемент. Не передается ни ссылка, ни объект
		//1.2. Непосредственно, но выбран элемент. Передается ссылка и объект
		//
		//2 Из формы объекта - элемента справочника контрагенты. Возможны два случая
		//2.1. Это новый элемент справочника (у него нет ссылки). Не передается ссылка, но передается объект
		//2.2. Это существующий элемент справочника (есть ссылка). Передается ссылка и объект
		
		Запрос = Новый Запрос();
		
		//Интерактивный вызов, т.е. не из формы элемента справочника
		//-----------------------------------------------------------
		Если СпрОбъект = Неопределено Тогда
			
			Запрос.Текст =  "ВЫБРАТЬ Т.Ссылка КАК Ссылка, Т.ИНН КАК ИНН, Т.КПП КАК КПП ИЗ Справочник.Контрагенты КАК Т ГДЕ Т.Тип = &Тип";
			Запрос.УстановитьПараметр("Тип", "ЮЛ");
			Запрос.УстановитьПараметр("СпрСсылка", СпрСсылка);
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Если (СтрДлина(СокрЛП(Выборка.ИНН))=10 И СтрДлина(СокрЛП(Выборка.КПП))=9) = Ложь Тогда
					Продолжить;
				КонецЕсли;
				
				СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
				КоличествоДобавленныхСтрок = ДобавитьСтроки_ЗаписатьСозданныйОбъект(ИсточникДанных, БИ, СпрОбъект);				
			КонецЦикла;
			
			//Не интерактивный вызов, из формы объекта - элемента справочника, всегда обрабатываетс одна запись в приемнике
			//---------------------------------------------------------------
		Иначе 			
			ДобавитьСтроки_ЗаписатьСозданныйОбъект(ИсточникДанных, БИ, СпрОбъект);
		КонецЕсли;
	КонецЦикла;
	
	Доступно = СпрОбъектБылоНеопределено;
	Доступно = Доступно И  КоличествоДобавленныхСтрок >0 ;
	
	Если Доступно Тогда
		Попытка
			СпрОбъект.Записать();
		Исключение
			Данные =  "ИНН = "+Выборка.ИНН+"; КПП="+Выборка.КПП;
			Комментарий=ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("ДобавитьСтроки_ЗаписатьСозданныйОбъект", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Контрагенты, Данные, Комментарий);
			Возврат ЗначениеПоУмолчанию;
		КонецПопытки	
	КонецЕсли;
	
	
	Возврат Истина;
	
КонецФункции
